In [1]:
# where is the youngest male in the group from?

#a. Find the answer using sort_values()

#b. Do some research and find the answer using where() and min()

#c. Do some research and find the answer using query() and min()

In [2]:
import pandas as pd
names=["Tom치s", "Pauline", "Pablo", "Bjork","Alan","Juana"]
woman=[False,True,False,False,False,True]
ages=[32,33,28,30,32,27]
country=["Chile", "Senegal", "Spain", "Norway","Peru","Peru"]
education=["Bach", "Bach", "Master", "PhD","Bach","Master"]

In [3]:
data={'names':names,'woman':woman,'ages':ages,'country':country,'education':education}
data

{'names': ['Tom치s', 'Pauline', 'Pablo', 'Bjork', 'Alan', 'Juana'],
 'woman': [False, True, False, False, False, True],
 'ages': [32, 33, 28, 30, 32, 27],
 'country': ['Chile', 'Senegal', 'Spain', 'Norway', 'Peru', 'Peru'],
 'education': ['Bach', 'Bach', 'Master', 'PhD', 'Bach', 'Master']}

In [4]:

friends=pd.DataFrame.from_dict(data)
friends

     names  woman  ages  country education
0    Tom치s  False    32    Chile      Bach
1  Pauline   True    33  Senegal      Bach
2    Pablo  False    28    Spain    Master
3    Bjork  False    30   Norway       PhD
4     Alan  False    32     Peru      Bach
5    Juana   True    27     Peru    Master

In [5]:
friends[~friends.woman].sort_values("ages",ascending=True).head(1).country

2    Spain
Name: country, dtype: object

In [6]:
filter2 = friends['woman']==False
filter2

0     True
1    False
2     True
3     True
4     True
5    False
Name: woman, dtype: bool

In [7]:
filter1 = friends['ages']==friends.ages.min()
filter1

0    False
1    False
2    False
3    False
4    False
5     True
Name: ages, dtype: bool

In [8]:
friends.where(filter1 & filter2).country
#not even sure if this is the format you want. I'm a little disappointed and want to do better....

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
Name: country, dtype: object

In [9]:
friends.where((friends['ages']==friends.ages.min())&(friends['woman']==False)).country
#WHY DOESN'T THIS WORK? It seems to work if I break everything apart though. This is befuddling and I need to understand why.

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
Name: country, dtype: object

In [10]:
friends.query('woman==False & ages==28').country
#I do not know how to do a min() function here in addition to these so I sub in ages==28... this is cheating

2    Spain
Name: country, dtype: object

In [11]:
friends.ages.min()
#this will not work in the above function... nor does # friends['ages'].min() #
# I don't know how to put this into a string format.

27

In [12]:
friends['ages'].min()
#what is the difference between this and friends.ages.min()? Neither work, however, in the query()

27